app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
---
  def create
    email_param = params[:session][:email].downcase
    user = User.find_by(email: email_param)